C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTE8 (number 11), LED1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED1_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED1_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED1_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED1_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE9 (number 12), LED2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED2_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED2_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED2_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED2_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD8 (number 137), DSPdp
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPdp_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPdp_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPdp_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPdp_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPdp_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD9 (number 138), DSPa
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPa_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPa_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPa_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPa_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPa_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD10 (number 139), DSPb
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPb_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPb_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPb_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPb_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPb_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD11 (number 140), DSPc
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPc_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPc_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPc_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPc_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPc_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD12 (number 141), DSPd
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPd_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPd_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPd_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPd_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPd_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD13 (number 142), DSPe
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPe_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPe_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPe_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPe_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPe_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                      /* @} */

