C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.h
/*! @name PORTD14 (number 143), DSPf
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPf_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPf_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPf_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPf_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPf_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD15 (number 144), DSPg
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSPg_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DSPg_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DSPg_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DSPg_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DSPg_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE12 (number 15), BEEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BEEP_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BEEP_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BEEP_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BEEP_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BEEP_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB17 (number 96), KEY1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KEY1_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KEY1_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_KEY1_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KEY1_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KEY1_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB18 (number 97), KEY2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KEY2_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KEY2_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_KEY2_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KEY2_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KEY2_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC7 (number 112), SW1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW1_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW1_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW1_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC16 (number 123), SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW2_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW2_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW2_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW2_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW2_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC17 (number 124), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW3_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW3_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW3_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW3_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW3_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC18 (number 125), SW4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW4_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW4_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW4_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW4_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW4_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB20 (number 99), QESa
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QESa_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QESa_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_QESa_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QESa_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QESa_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                      /* @} */

