C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.h
/*! @name PORTB19 (number 98), QESb
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QESb_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QESb_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_QESb_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QESb_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QESb_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB21 (number 100), QESp
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_QESp_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_QESp_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_QESp_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QESp_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QESp_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE11 (number 14), I2C3_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C3_SCL_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C3_SCL_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C3_SCL_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE10 (number 13), I2C3_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_I2C3_SDA_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_I2C3_SDA_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_I2C3_SDA_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA26 (number 77), OLED_SCL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OLED_SCL_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OLED_SCL_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_SCL_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_SCL_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_SCL_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA27 (number 78), OLED_SDA
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OLED_SDA_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OLED_SDA_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_SDA_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_SDA_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_SDA_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA28 (number 79), OLED_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OLED_RST_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OLED_RST_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_RST_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_RST_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_RST_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA29 (number 80), OLED_DC
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_OLED_DC_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_OLED_DC_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_DC_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_DC_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_DC_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTB0 (number 81), CAMD0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD0_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD0_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB1 (number 82), CAMD1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB2 (number 83), CAMD2
  @{ */

