C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD2_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB3 (number 84), CAMD3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD3_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB4 (number 85), CAMD4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD4_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD4_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD4_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD4_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB5 (number 86), CAMD5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD5_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD5_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD5_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD5_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD5_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB6 (number 87), CAMD6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD6_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD6_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD6_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD6_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD6_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB7 (number 88), CAMD7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMD7_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMD7_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMD7_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMD7_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMD7_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB8 (number 89), CAMPCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMPCLK_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMPCLK_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMPCLK_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMPCLK_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMPCLK_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB9 (number 90), CAMSCL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMSCL_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMSCL_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMSCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMSCL_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMSCL_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTB10 (number 91), CAMSDA
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMSDA_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMSDA_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMSDA_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMSDA_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMSDA_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB11 (number 92), CAMHREF
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMHREF_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMHREF_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMHREF_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMHREF_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMHREF_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTB16 (number 95), CAMVSYN
  @{ */

