C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAMVSYN_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CAMVSYN_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CAMVSYN_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CAMVSYN_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CAMVSYN_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTA14 (number 66), DbgUart_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DbgUart_TX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DbgUart_TX_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DbgUart_TX_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA15 (number 67), DbgUart_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DbgUart_RX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DbgUart_RX_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DbgUart_RX_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name ADC0_DM0 (number 28), MEMSx
  @{ */
/* @} */

/*! @name ADC0_DP3 (number 29), MEMSy
  @{ */
/* @} */

/*! @name ADC1_DM0 (number 30), MEMSz
  @{ */
/* @} */

/*! @name PORTC5 (number 110), CCDCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CCDCLK_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CCDCLK_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CCDCLK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CCDCLK_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CCDCLK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC6 (number 111), CCDSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CCDSI_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CCDSI_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CCDSI_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CCDSI_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CCDSI_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC0 (number 103), CCDAO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CCDAO_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CCDAO_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CCDAO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD0 (number 127), SERVO1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SERVO1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SERVO1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SERVO1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD1 (number 128), SERVO2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SERVO2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SERVO2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SERVO2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTA9 (number 61), MLEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MLEN_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MLEN_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MLEN_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MLEN_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MLEN_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC15 (number 120), MREN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MREN_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MREN_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MREN_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MREN_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MREN_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA5 (number 55), ML0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ML0_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ML0_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ML0_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA6 (number 58), ML1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ML1_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ML1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ML1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTD4 (number 131), MR0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MR0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MR0_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MR0_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                    /* @} */

