C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.h
/*! @name PORTD7 (number 136), MR1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MR1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MR1_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MR1_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTD6 (number 133), VSENSE
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VSENSE_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VSENSE_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VSENSE_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name ADC1_SE18 (number 37), IRV1
  @{ */
/* @} */

/*! @name ADC0_SE23 (number 38), IRV2
  @{ */
/* @} */

/*! @name ADC1_SE23 (number 39), HALL1
  @{ */
/* @} */

/*! @name PORTE24 (number 45), HALL2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_HALL2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_HALL2_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_HALL2_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
